polesskiy-dev/iot-risk-data-logger-nfc-samd21/firmware/src/packs/ATSAMD21E18A_DFP/component/eic.h
#define EIC_INTFLAG_EXTINT_Pos                _UINT32_(0)                                          /* (EIC_INTFLAG Position) External Interrupt x5 */
#define EIC_INTFLAG_EXTINT_Msk                (_UINT32_(0xFFFF) << EIC_INTFLAG_EXTINT_Pos)         /* (EIC_INTFLAG Mask) EXTINT */
#define EIC_INTFLAG_EXTINT(value)             (EIC_INTFLAG_EXTINT_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT_Pos)) 

/* -------- EIC_WAKEUP : (EIC Offset: 0x14) (R/W 32) Wake-Up Enable -------- */
#define EIC_WAKEUP_RESETVALUE                 _UINT32_(0x00)                                       /*  (EIC_WAKEUP) Wake-Up Enable  Reset Value */

#define EIC_WAKEUP_WAKEUPEN0_Pos              _UINT32_(0)                                          /* (EIC_WAKEUP) External Interrupt 0 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN0_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN0_Pos)          /* (EIC_WAKEUP) External Interrupt 0 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN0(value)           (EIC_WAKEUP_WAKEUPEN0_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN0_Pos)) /* Assigment of value for WAKEUPEN0 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN1_Pos              _UINT32_(1)                                          /* (EIC_WAKEUP) External Interrupt 1 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN1_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN1_Pos)          /* (EIC_WAKEUP) External Interrupt 1 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN1(value)           (EIC_WAKEUP_WAKEUPEN1_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN1_Pos)) /* Assigment of value for WAKEUPEN1 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN2_Pos              _UINT32_(2)                                          /* (EIC_WAKEUP) External Interrupt 2 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN2_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN2_Pos)          /* (EIC_WAKEUP) External Interrupt 2 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN2(value)           (EIC_WAKEUP_WAKEUPEN2_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN2_Pos)) /* Assigment of value for WAKEUPEN2 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN3_Pos              _UINT32_(3)                                          /* (EIC_WAKEUP) External Interrupt 3 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN3_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN3_Pos)          /* (EIC_WAKEUP) External Interrupt 3 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN3(value)           (EIC_WAKEUP_WAKEUPEN3_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN3_Pos)) /* Assigment of value for WAKEUPEN3 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN4_Pos              _UINT32_(4)                                          /* (EIC_WAKEUP) External Interrupt 4 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN4_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN4_Pos)          /* (EIC_WAKEUP) External Interrupt 4 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN4(value)           (EIC_WAKEUP_WAKEUPEN4_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN4_Pos)) /* Assigment of value for WAKEUPEN4 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN5_Pos              _UINT32_(5)                                          /* (EIC_WAKEUP) External Interrupt 5 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN5_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN5_Pos)          /* (EIC_WAKEUP) External Interrupt 5 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN5(value)           (EIC_WAKEUP_WAKEUPEN5_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN5_Pos)) /* Assigment of value for WAKEUPEN5 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN6_Pos              _UINT32_(6)                                          /* (EIC_WAKEUP) External Interrupt 6 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN6_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN6_Pos)          /* (EIC_WAKEUP) External Interrupt 6 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN6(value)           (EIC_WAKEUP_WAKEUPEN6_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN6_Pos)) /* Assigment of value for WAKEUPEN6 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN7_Pos              _UINT32_(7)                                          /* (EIC_WAKEUP) External Interrupt 7 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN7_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN7_Pos)          /* (EIC_WAKEUP) External Interrupt 7 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN7(value)           (EIC_WAKEUP_WAKEUPEN7_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN7_Pos)) /* Assigment of value for WAKEUPEN7 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN8_Pos              _UINT32_(8)                                          /* (EIC_WAKEUP) External Interrupt 8 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN8_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN8_Pos)          /* (EIC_WAKEUP) External Interrupt 8 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN8(value)           (EIC_WAKEUP_WAKEUPEN8_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN8_Pos)) /* Assigment of value for WAKEUPEN8 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN9_Pos              _UINT32_(9)                                          /* (EIC_WAKEUP) External Interrupt 9 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN9_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN9_Pos)          /* (EIC_WAKEUP) External Interrupt 9 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN9(value)           (EIC_WAKEUP_WAKEUPEN9_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN9_Pos)) /* Assigment of value for WAKEUPEN9 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN10_Pos             _UINT32_(10)                                         /* (EIC_WAKEUP) External Interrupt 10 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN10_Msk             (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN10_Pos)         /* (EIC_WAKEUP) External Interrupt 10 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN10(value)          (EIC_WAKEUP_WAKEUPEN10_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN10_Pos)) /* Assigment of value for WAKEUPEN10 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN11_Pos             _UINT32_(11)                                         /* (EIC_WAKEUP) External Interrupt 11 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN11_Msk             (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN11_Pos)         /* (EIC_WAKEUP) External Interrupt 11 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN11(value)          (EIC_WAKEUP_WAKEUPEN11_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN11_Pos)) /* Assigment of value for WAKEUPEN11 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN12_Pos             _UINT32_(12)                                         /* (EIC_WAKEUP) External Interrupt 12 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN12_Msk             (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN12_Pos)         /* (EIC_WAKEUP) External Interrupt 12 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN12(value)          (EIC_WAKEUP_WAKEUPEN12_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN12_Pos)) /* Assigment of value for WAKEUPEN12 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN13_Pos             _UINT32_(13)                                         /* (EIC_WAKEUP) External Interrupt 13 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN13_Msk             (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN13_Pos)         /* (EIC_WAKEUP) External Interrupt 13 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN13(value)          (EIC_WAKEUP_WAKEUPEN13_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN13_Pos)) /* Assigment of value for WAKEUPEN13 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN14_Pos             _UINT32_(14)                                         /* (EIC_WAKEUP) External Interrupt 14 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN14_Msk             (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN14_Pos)         /* (EIC_WAKEUP) External Interrupt 14 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN14(value)          (EIC_WAKEUP_WAKEUPEN14_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN14_Pos)) /* Assigment of value for WAKEUPEN14 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN15_Pos             _UINT32_(15)                                         /* (EIC_WAKEUP) External Interrupt 15 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN15_Msk             (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN15_Pos)         /* (EIC_WAKEUP) External Interrupt 15 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN15(value)          (EIC_WAKEUP_WAKEUPEN15_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN15_Pos)) /* Assigment of value for WAKEUPEN15 in the EIC_WAKEUP register */
#define EIC_WAKEUP_Msk                        _UINT32_(0x0000FFFF)                                 /* (EIC_WAKEUP) Register Mask  */

#define EIC_WAKEUP_WAKEUPEN_Pos               _UINT32_(0)                                          /* (EIC_WAKEUP Position) External Interrupt x5 Wake-up Enable */
#define EIC_WAKEUP_WAKEUPEN_Msk               (_UINT32_(0xFFFF) << EIC_WAKEUP_WAKEUPEN_Pos)        /* (EIC_WAKEUP Mask) WAKEUPEN */
#define EIC_WAKEUP_WAKEUPEN(value)            (EIC_WAKEUP_WAKEUPEN_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN_Pos)) 

/* -------- EIC_CONFIG : (EIC Offset: 0x18) (R/W 32) Configuration n -------- */
#define EIC_CONFIG_RESETVALUE                 _UINT32_(0x00)                                       /*  (EIC_CONFIG) Configuration n  Reset Value */

